# Desafio 1

Para esse desafio, vamos trabalhar com o data set [Black Friday](https://www.kaggle.com/mehdidag/black-friday), que reúne dados sobre transações de compras em uma loja de varejo.

Vamos utilizá-lo para praticar a exploração de data sets utilizando pandas. Você pode fazer toda análise neste mesmo notebook, mas as resposta devem estar nos locais indicados.

> Obs.: Por favor, não modifique o nome das funções de resposta.

## _Set up_ da análise

In [1]:
import pandas as pd
import numpy as np

Carregando o datasets

In [2]:
black_friday = pd.read_csv("black_friday.csv")

## Inicie sua análise a partir daqui

In [3]:
#Verificando os dados
black_friday.head(6)

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,1000001,P00069042,F,0-17,10,A,2,0,3,NaN,NaN,8370
1,1000001,P00248942,F,0-17,10,A,2,0,1,6.0,14.0,15200
2,1000001,P00087842,F,0-17,10,A,2,0,12,NaN,NaN,1422
3,1000001,P00085442,F,0-17,10,A,2,0,12,14.0,NaN,1057
4,1000002,P00285442,M,55+,16,C,4+,0,8,NaN,NaN,7969
5,1000003,P00193542,M,26-35,15,A,3,0,1,2.0,NaN,15227

In [4]:
#Descri
black_friday.describe()

,User_ID,Occupation,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
count,5.375770e+05,537577.00000,537577.000000,537577.000000,370591.000000,164278.000000,537577.000000
mean,1.002992e+06,8.08271,0.408797,5.295546,9.842144,12.669840,9333.859853
std,1.714393e+03,6.52412,0.491612,3.750701,5.087259,4.124341,4981.022133
min,1.000001e+06,0.00000,0.000000,1.000000,2.000000,3.000000,185.000000
25%,1.001495e+06,2.00000,0.000000,1.000000,5.000000,9.000000,5866.000000
50%,1.003031e+06,7.00000,0.000000,5.000000,9.000000,14.000000,8062.000000
75%,1.004417e+06,14.00000,1.000000,8.000000,15.000000,16.000000,12073.000000
max,1.006040e+06,20.00000,1.000000,18.000000,18.000000,18.000000,23961.000000

## Questão 1

Quantas observações e quantas colunas há no dataset? Responda no formato de uma tuple `(n_observacoes, n_colunas)`.

In [5]:
def q1():
    # Retorne aqui o resultado da questão 1.
    return black_friday.shape

In [6]:
q1()

(537577, 12)

## Questão 2

Há quantas mulheres com idade entre 26 e 35 anos no dataset? Responda como um único escalar.

In [7]:
def q2():
    # Retorne aqui o resultado da questão 2.
    df_filter = black_friday[(black_friday['Gender'] =='F') & (black_friday['Age'] =='26-35')]
    return (df_filter.shape[0])

In [8]:
q2()

49348

## Questão 3

Quantos usuários únicos há no dataset? Responda como um único escalar.

In [9]:
def q3():
    # Retorne aqui o resultado da questão 3.
    return black_friday['User_ID'].nunique()

In [10]:
q3()

5891

## Questão 4

Quantos tipos de dados diferentes existem no dataset? Responda como um único escalar.

In [11]:
def q4():
    # Retorne aqui o resultado da questão 4.
    values_types = black_friday.dtypes.value_counts()
    return len(values_types)

In [12]:
q4()

3

## Questão 5

Qual porcentagem dos registros possui ao menos um valor null (`None`, `ǸaN` etc)? Responda como um único escalar entre 0 e 1.

In [13]:
def q5():
    # Retorne aqui o resultado da questão 5.
    missing_values = max(black_friday.isna().sum(axis='rows'))/black_friday.shape[0]
    return missing_values

In [14]:
q5()

0.6944102891306734

## Questão 6

Quantos valores null existem na variável (coluna) com o maior número de null? Responda como um único escalar.

In [15]:
def q6():
    # Retorne aqui o resultado da questão 6.
    columns_value = int(max(black_friday.isna().sum()))
    return columns_value

In [16]:
q6()

373299

## Questão 7

Qual o valor mais frequente (sem contar nulls) em `Product_Category_3`? Responda como um único escalar.

In [17]:
black_friday.columns

Index(['User_ID', 'Product_ID', 'Gender', 'Age', 'Occupation', 'City_Category',
       'Stay_In_Current_City_Years', 'Marital_Status', 'Product_Category_1',
       'Product_Category_2', 'Product_Category_3', 'Purchase'],
      dtype='object')

In [18]:
def q7():
    # Retorne aqui o resultado da questão 7.
    return float(black_friday['Product_Category_3'].dropna().mode())

In [19]:
q7()

16.0

## Questão 8

Qual a nova média da variável (coluna) `Purchase` após sua normalização? Responda como um único escalar.

In [20]:

def q8():
    # Retorne aqui o resultado da questão 8.
    var = black_friday['Purchase']
    value_min = black_friday['Purchase'].min()
    value_max = black_friday['Purchase'].max()
    value_normalized = (var - value_min)/(value_max - value_min)
    return float(value_normalized.mean())

In [21]:
q8()

0.38479390362696736

## Questão 9

Quantas ocorrências entre -1 e 1 inclusive existem da variáel `Purchase` após sua padronização? Responda como um único escalar.

In [22]:
def q9():
    # Retorne aqui o resultado da questão 9.
    df_mean = black_friday['Purchase'].mean()
    df_std = black_friday['Purchase'].std()
    df_standardized = (black_friday['Purchase'] - df_mean)/(df_std)
    return int(((df_standardized >= -1) & (df_standardized <= 1)).sum())

In [23]:
q9()

348631

## Questão 10

Podemos afirmar que se uma observação é null em `Product_Category_2` ela também o é em `Product_Category_3`? Responda com um bool (`True`, `False`).

In [24]:
def q10():
    # Retorne aqui o resultado da questão 10.
    Prod2_na = black_friday['Product_Category_2'].isna()
    Prod3_na = black_friday['Product_Category_3'].isna()
    return bool(Prod2_na[Prod2_na ==True].equals(Prod3_na[Prod2_na ==True]))

In [25]:
q10()

True